{
  "backend/main.mo": "No summary available.",
  "feature_evidence.json": "No summary available.",
  "frontend-file-summaries.txt": "No summary available.",
  "frontend/index.css": "No summary available.",
  "frontend/index.html": "No summary available.",
  "frontend/src/App.tsx": "No summary available.",
  "frontend/src/components/admin/AdminSummaryTab.tsx": "No summary available.",
  "frontend/src/components/admin/AsistenmuManagementPanel.tsx": "UI panel to assign Asistenmu roles via principal ID and display a table of existing Asistenmu users.",
  "frontend/src/components/admin/ClientsTab.tsx": "Client management tab with summary metrics, search input, and a filterable client table.",
  "frontend/src/components/admin/LayananTab.tsx": "Service subscription tab that switches between a subscriptions list and a create/edit form.",
  "frontend/src/components/admin/PendingPartnersPanel.tsx": "Panel displaying pending and active partner applications with approval and rejection actions.",
  "frontend/src/components/admin/ReadOnlyPlaceholderPanel.tsx": "Reusable placeholder panel indicating a feature is not yet available with preview skeletons.",
  "frontend/src/components/admin/SubscriptionManagementForm.tsx": "Form for creating or editing service subscriptions with validation, identity lookup, and mutation handling.",
  "frontend/src/components/admin/SubscriptionsTable.tsx": "Renders a filterable, paginated subscriptions table with service-type, status, quantity, and date filters, using backend query hooks.",
  "frontend/src/components/AdminOnlyActions.tsx": "No summary available.",
  "frontend/src/components/AdminOwnerStatusCard.tsx": "No summary available.",
  "frontend/src/components/AuthButton.tsx": "No summary available.",
  "frontend/src/components/ProfileSetupModal.tsx": "No summary available.",
  "frontend/src/components/requests/AsistenmuRequestCard.tsx": "Displays a single request card with status update actions, including progressing work or requesting client review.",
  "frontend/src/components/requests/AsistenmuRequestsTab.tsx": "Shows new Asistenmu requests in a list, filtering incoming requests and rendering each via AsistenmuRequestCard.",
  "frontend/src/components/requests/ClientCreateRequestForm.tsx": "Modal form allowing clients to submit new requests with title, details, and optional deadline.",
  "frontend/src/components/requests/ClientRequestTabs.tsx": "Organizes client requests into tabbed categories such as delegating, in‑progress, review, revising, and completed.",
  "frontend/src/components/requests/ClientReviewActions.tsx": "Provides client-side actions to request revisions or mark a request as completed with confirmation dialogs.",
  "frontend/src/components/requests/RequestListState.tsx": "Handles loading, error, empty, and list states for rendering request lists uniformly.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance tied to user identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider to manage Internet Identity authentication, storing identity state and handling login/logout flows.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, roles, services, and subscriptions via the backend actor.",
  "frontend/src/hooks/useRequests.ts": "Implements request-related query and mutation hooks for client and Asistenmu requests, assuming backend CRUD methods will be added.",
  "frontend/src/index.css": "Sets up Tailwind base styles and defines a warm terracotta theme with light and dark mode CSS variables.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/AccessDeniedPage.tsx": "Displays an access denied message with a styled card and a button to return home.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Renders the admin dashboard UI, loading the user profile, enforcing authentication, and showing tabs for admin management.",
  "frontend/src/pages/AsistenmuDashboardPage.tsx": "Shows the Asistenmu dashboard with profile loading, logout handling, and a tab for managing client requests.",
  "frontend/src/pages/ClientDashboardPage.tsx": "Renders the client dashboard showing subscription status, request creation, and logout handling with profile and subscription queries.",
  "frontend/src/pages/ClientRegistrationPage.tsx": "Empty placeholder page for client registration UI.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with login via Internet Identity and marketing sections, redirecting authenticated users to the dashboard.",
  "frontend/src/pages/PartnerApplyPage.tsx": "Empty placeholder page for partner application flow.",
  "frontend/src/pages/PartnerDashboardPage.tsx": "Empty placeholder page for partner dashboard UI.",
  "frontend/src/routes/RoleRouter.tsx": "Determines user role after authentication and redirects to the appropriate dashboard with a loading state.",
  "frontend/src/utils/principals.ts": "Utilities for validating, normalizing, and deduplicating Dfinity principal IDs.",
  "frontend/src/utils/time.ts": "Helpers for converting between bigint nanoseconds and Date plus formatting for display and inputs.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, persisting them in sessionStorage, and cleaning them from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, animations, and plugins.",
  "project_state.json": "Project state file describing feature versions and current system design decisions."
}