{
  "backend/main.mo": "Defines user, partner, service, subscription, request, and task types for the backend actor, supporting role management and service operations.",
  "feature_evidence.json": "Lists implemented features with associated files, components, test IDs, and confidence metadata.",
  "frontend-file-summaries.txt": "Contains human‑written summaries of various frontend files for reference in build planning.",
  "frontend/index.css": "Defines global OKLCH color variables, dark mode mappings, and base Tailwind layer styles.",
  "frontend/index.html": "Basic HTML entry point with SEO metadata and script loader for the React app.",
  "frontend/src/App.tsx": "Sets up the app’s router, role‑protected dashboard routes, and theme provider.",
  "frontend/src/components/admin/AdminSummaryTab.tsx": "Displays dashboard summary cards for key metrics using mock data placeholders.",
  "frontend/src/components/admin/AsistenmuManagementPanel.tsx": "Provides a form to assign Asistenmu roles and shows a table of current assistants using mock data.",
  "frontend/src/components/admin/ClientsTab.tsx": "Shows client statistics and a searchable table of clients, all based on mock data.",
  "frontend/src/components/admin/LayananTab.tsx": "Manages subscription records with tabs for listing and creating/editing subscriptions.",
  "frontend/src/components/admin/PendingPartnersPanel.tsx": "Displays pending and active partner lists with approve/reject actions, using mock data.",
  "frontend/src/components/admin/ReadOnlyPlaceholderPanel.tsx": "Shows a locked read-only placeholder panel indicating a feature under development.",
  "frontend/src/components/admin/SubscriptionManagementForm.tsx": "Form component for creating and editing subscriptions with validation, identity lookups, and mutation handling.",
  "frontend/src/components/admin/SubscriptionsTable.tsx": "Displays a paginated, filterable table of subscriptions with options to create or edit entries.",
  "frontend/src/components/AdminOnlyActions.tsx": "Empty placeholder file.",
  "frontend/src/components/AdminOwnerStatusCard.tsx": "Empty placeholder file.",
  "frontend/src/components/asistenmu/AsistenmuCompletedTab.tsx": "Shows completed Asistenmu requests with final report details.",
  "frontend/src/components/asistenmu/AsistenmuIncomingRequestsTab.tsx": "Displays newly created incoming requests with creation date and optional deadline.",
  "frontend/src/components/asistenmu/AsistenmuInProgressTab.tsx": "Lists tasks currently being worked on by partners, showing basic request and partner info.",
  "frontend/src/components/asistenmu/AsistenmuQARequestsTab.tsx": "Manages QA requests, allowing Asistenmu to request revisions or mark tasks as complete.",
  "frontend/src/components/asistenmu/AsistenmuRejectedTab.tsx": "Shows tasks rejected by partners along with rejection reasons.",
  "frontend/src/components/asistenmu/PartnerAssignmentTab.tsx": "UI for assigning new client requests to partners, including search, selection, and submission of task details.",
  "frontend/src/components/AuthButton.tsx": "Login/logout button integrating Internet Identity with retry logic for existing sessions.",
  "frontend/src/components/client/clientIds.ts": "Generates a stable client ID from a principal ID using a simple hash and fixed format.",
  "frontend/src/components/client/ClientProfileSection.tsx": "Displays and edits client profile info, shows client IDs, and handles profile updates and copy actions.",
  "frontend/src/components/client/ClientRequestSummaryCards.tsx": "Renders summarized counts of client requests by status with icon-based cards.",
  "frontend/src/components/client/CollapsibleSection.tsx": "Reusable collapsible card component that toggles visibility of its content.",
  "frontend/src/components/MasukButton.tsx": "Localized login button using Internet Identity with retry and logout handling.",
  "frontend/src/components/partner/PartnerActiveWorkTab.tsx": "Shows partner’s active in‑progress tasks and allows sending QA requests.",
  "frontend/src/components/partner/PartnerCompletedWorkTab.tsx": "Lists completed partner tasks with final report details and status indicators.",
  "frontend/src/components/partner/PartnerEarningsTab.tsx": "Displays partner earnings summary and detailed earnings history for completed tasks.",
  "frontend/src/components/partner/PartnerNewWorkTab.tsx": "Displays new work offers for partners, enabling them to accept or reject tasks with confirmation and reason input.",
  "frontend/src/components/partner/PartnerRejectedWorkTab.tsx": "Shows a partner’s rejected tasks along with rejection statistics and detailed reasons for each rejected request.",
  "frontend/src/components/partner/PartnerRevisionRequestsTab.tsx": "Lists tasks that require revisions from the partner, including revision notes from Asistenmu.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty placeholder file.",
  "frontend/src/components/requests/AsistenmuRequestCard.tsx": "Empty file with no implemented content.",
  "frontend/src/components/requests/AsistenmuRequestsTab.tsx": "Empty file with no implemented content.",
  "frontend/src/components/requests/ClientCreateRequestForm.tsx": "Form for clients to create requests, selecting subscriptions, entering details, and submitting to backend with validation.",
  "frontend/src/components/requests/ClientRequestTabs.tsx": "Organizes client requests into status-based tabs and renders lists for each state using RequestListState.",
  "frontend/src/components/requests/ClientReviewActions.tsx": "Empty file with no implemented content.",
  "frontend/src/components/requests/RequestListState.tsx": "Utility component that handles loading, empty, error, and render states for request lists.",
  "frontend/src/components/RoleResolutionErrorState.tsx": "UI component showing an error state when a user's role cannot be resolved, with retry and home actions.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider to manage Internet Identity authentication, exposing identity state, login, and logout utilities.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profile, roles, and service data using the backend actor.",
  "frontend/src/hooks/useRequests.ts": "Implements React Query hooks for managing request-related operations such as fetching, creating, searching partners, and assigning tasks.",
  "frontend/src/hooks/useSafeActor.ts": "Creates and caches a backend actor tied to the current identity, reinitializing on identity changes and handling optional admin setup.",
  "frontend/src/index.css": "Defines Tailwind-based global styles, color variables, dark mode settings, and shared UI component styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider, then renders the main App component.",
  "frontend/src/pages/AccessDeniedPage.tsx": "Displays an access denied message with a styled card and a button to return to the home page.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Renders the admin dashboard, enforcing authentication and showing profile data, header, and multiple management tabs.",
  "frontend/src/pages/AsistenmuDashboardPage.tsx": "Renders the Asistenmu dashboard with tabs for request states and handles profile loading and logout.",
  "frontend/src/pages/ClientDashboardPage.tsx": "Displays the client dashboard with profile, subscription summary, request creation, and request lists, including logout handling.",
  "frontend/src/pages/ClientRegistrationPage.tsx": "Empty placeholder page for client registration.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with navigation, hero section, auto-redirect on login, and marketing content.",
  "frontend/src/pages/PartnerApplyPage.tsx": "Provides a partner application form with validation and submission, showing a success screen after registration.",
  "frontend/src/pages/PartnerDashboardPage.tsx": "Renders the partner dashboard with profile stats and tabs for task states, including logout handling.",
  "frontend/src/routes/RequireDomainRole.tsx": "Route guard that checks authentication and domain role, redirecting or showing loading/error states accordingly.",
  "frontend/src/routes/RoleRouter.tsx": "Handles identity and domain-role resolution, redirecting users to role-specific dashboards or showing error/no-role states.",
  "frontend/src/utils/principals.ts": "Provides validation, normalization, and format-checking utilities for Dfinity Principal IDs.",
  "frontend/src/utils/time.ts": "Converts bigint nanosecond timestamps to Date objects and provides formatting helpers for display and input.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters, including session-backed storage and hash parsing.",
  "frontend/tailwind.config.js": "TailwindCSS configuration extending theme colors, radii, shadows, and enabling plugins like typography and container queries.",
  "project_state.json": "Project state metadata describing the current workflow, role behaviors, UI structure, and known issues across the system."
}