{
  "kind": "build_request",
  "title": "Unify translucent white headers, adjust landing hero headline wrapping, and fix all Login (II) buttons",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-118",
      "text": "Update the header styling on the Landing page and all dashboard pages (Admin, Client, Asistenmu, Partner) to use a white header with slight transparency, a subtle bottom divider, and a backdrop blur effect so underlying content remains visible while header text stays readable during scroll. Avoid heavy drop shadows.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "buat header di semua dashboard dan landing page dengan warna putih tanpa shadow berat hanya pemisah halus sehingga saat di scroll background tetap terlihat seperti blur sehingga tulisan di header tetap terlihat.",
          "2. putih dengan sedikit transparansi"
        ]
      },
      "acceptanceCriteria": [
        "LandingPage and each dashboard page header is sticky and uses a translucent white background (not solid dark/gray).",
        "A backdrop blur is applied (e.g., via Tailwind backdrop-blur classes) so content behind the header appears blurred when scrolling.",
        "There is a subtle bottom border/divider line; there is no heavy shadow on the header.",
        "Header content (logo/text/buttons) remains readable on scroll across light backgrounds."
      ]
    },
    {
      "id": "REQ-119",
      "text": "Adjust the Landing page hero headline typography so it renders as exactly two lines (one sentence per line) with a smaller font size, and update the headline text casing to match the requested two-line copy.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Tulisan di hero section  untuk Headline buat lebih kecil sehingga cukup untuk satu kalimat per barisnya untuk tulisan \"Tenang menjalani hari,\ndidampingi oleh Asistenmu dengan rapi.\"",
          "3. mengecilkan font size agar pas 1 line per kalimat\nseperti ini : \nTenang menjalani hari,\nDidampingi oleh Asistenmu dengan rapi."
        ]
      },
      "acceptanceCriteria": [
        "The hero headline text is exactly:\nLine 1: \"Tenang menjalani hari,\"\nLine 2: \"Didampingi oleh Asistenmu dengan rapi.\"",
        "The hero headline font size is reduced from the current sizing so each sentence fits on a single line on typical mobile and desktop widths (no unintended wrapping beyond the explicit line break).",
        "Only the hero headline typography/copy is changed; other hero content remains intact."
      ]
    },
    {
      "id": "REQ-120",
      "text": "Fix all \"Masuk\" / login buttons across the app so they correctly trigger the Internet Identity (II) login flow (restoring previous behavior), using the existing Internet Identity hook/logic without editing immutable authentication hook files.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "perbaiki tombol masuk agar memanggil fungsi login dengan menggunakan II",
          "1. Semua tombol masuk menjadi bisa login dengan II seperti sebelumnya"
        ]
      },
      "acceptanceCriteria": [
        "Every UI control labeled \"Masuk\" (or otherwise intended to log in) triggers the II login flow and successfully authenticates the user.",
        "After a successful login from public pages, the app can proceed to the existing role-based routing behavior (e.g., redirect to /dashboard and onward as currently implemented).",
        "No changes are made to files under the immutable paths listed in SYSTEM_CONTEXT (authentication hooks are composed/used as-is).",
        "Login buttons properly handle the logging-in state (disabled/loading) to prevent double-click issues."
      ]
    }
  ],
  "constraints": [
    "Frontend files under the immutable paths in SYSTEM_CONTEXT must not be edited (compose existing authentication hooks/components instead).",
    "Keep the existing app routes and role-based routing behavior intact; only fix the login triggers and UI styling requested.",
    "Do not introduce heavy header shadows; use only a subtle divider and translucency + blur.",
    "Use English for any user-facing text in this build request document (the app UI copy changes are only those explicitly requested for the hero headline)."
  ],
  "nonGoals": [
    "No backend/canister changes are required for this request.",
    "No redesign of page layouts beyond header styling and the specific hero headline typography/copy change.",
    "No new authentication provider or third-party auth integration (Internet Identity only)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}