{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Translucent white sticky headers, hero headline wrapping, and restored II login triggers",
  "requirements": [
    {
      "id": "REQ-118",
      "summary": "Unify Landing + dashboard headers to a sticky translucent white style with subtle divider and backdrop blur (no heavy shadows).",
      "acceptanceCriteria": [
        "LandingPage and each dashboard page header is sticky and uses a translucent white background (not solid dark/gray).",
        "A backdrop blur is applied (e.g., via Tailwind backdrop-blur classes) so content behind the header appears blurred when scrolling.",
        "There is a subtle bottom border/divider line; there is no heavy shadow on the header.",
        "Header content (logo/text/buttons) remains readable on scroll across light backgrounds."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add a shared header utility/class (e.g., an @layer components class) that applies: sticky top positioning, translucent white background, backdrop blur, and a subtle bottom divider while avoiding heavy drop shadows. This enables consistent header styling across Landing and all dashboards."
        },
        {
          "path": "frontend/src/pages/LandingPage.tsx",
          "operation": "modify",
          "description": "Update the Landing page <header> to use the shared translucent-white + backdrop-blur + subtle divider header styling (replacing the current fully transparent header) while keeping existing layout/navigation intact."
        },
        {
          "path": "frontend/src/pages/AdminDashboardPage.tsx",
          "operation": "modify",
          "description": "Update the Admin dashboard <header> styling to match the shared translucent white header (ensure subtle divider and blur remain; remove/avoid heavy header shadows)."
        },
        {
          "path": "frontend/src/pages/ClientDashboardPage.tsx",
          "operation": "modify",
          "description": "Update the Client dashboard <header> styling to match the shared translucent white header (sticky, blur, subtle divider; no heavy shadow)."
        },
        {
          "path": "frontend/src/pages/AsistenmuDashboardPage.tsx",
          "operation": "modify",
          "description": "Update the Asistenmu dashboard <header> styling to match the shared translucent white header (sticky, blur, subtle divider; no heavy shadow)."
        },
        {
          "path": "frontend/src/pages/PartnerDashboardPage.tsx",
          "operation": "modify",
          "description": "Update the Partner dashboard <header> styling to match the shared translucent white header (sticky, blur, subtle divider; no heavy shadow)."
        }
      ]
    },
    {
      "id": "REQ-119",
      "summary": "Adjust Landing hero headline copy/casing and typography so it renders as exactly two explicit lines with a smaller font size.",
      "acceptanceCriteria": [
        "The hero headline text is exactly:\nLine 1: \"Tenang menjalani hari,\"\nLine 2: \"Didampingi oleh Asistenmu dengan rapi.\"",
        "The hero headline font size is reduced from the current sizing so each sentence fits on a single line on typical mobile and desktop widths (no unintended wrapping beyond the explicit line break).",
        "Only the hero headline typography/copy is changed; other hero content remains intact."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LandingPage.tsx",
          "operation": "modify",
          "description": "Update the hero headline to the requested two-line copy with the corrected casing on line 2, and reduce headline typography sizing so each sentence stays on its own line (beyond the explicit line break) on typical mobile/desktop widths while leaving other hero content unchanged."
        }
      ]
    },
    {
      "id": "REQ-120",
      "summary": "Ensure every \"Masuk\"/login control reliably triggers the existing Internet Identity login flow with proper loading/disabled state, without changing immutable auth-hook files.",
      "acceptanceCriteria": [
        "Every UI control labeled \"Masuk\" (or otherwise intended to log in) triggers the II login flow and successfully authenticates the user.",
        "After a successful login from public pages, the app can proceed to the existing role-based routing behavior (e.g., redirect to /dashboard and onward as currently implemented).",
        "No changes are made to files under the immutable paths listed in SYSTEM_CONTEXT (authentication hooks are composed/used as-is).",
        "Login buttons properly handle the logging-in state (disabled/loading) to prevent double-click issues."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MasukButton.tsx",
          "operation": "create",
          "description": "Create a shared \"Masuk\" login button component that composes the existing Internet Identity hook logic (useInternetIdentity) to call login(), uses loginStatus to disable/indicate loading to prevent double-clicks, and (when applicable) clears query cache on logout. Use the selected \"authorization\" component’s frontend authentication guidance for handling login status and cache clearing; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/LandingPage.tsx",
          "operation": "modify",
          "description": "Replace the Landing page inline handleLogin + \"Masuk\" button wiring with the shared MasukButton component so clicking \"Masuk\" consistently triggers the II login flow and reflects the logging-in disabled/loading state. Use the selected \"authorization\" component’s frontend authentication guidance; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/AuthButton.tsx",
          "operation": "modify",
          "description": "Align AuthButton’s login click handling with the shared II login flow expectations (e.g., ensure disabled state during loginStatus === 'logging-in' and consistent error handling), without editing immutable hook files. Use the selected \"authorization\" component’s frontend authentication guidance; verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}